<a href="https://colab.research.google.com/github/Arko2016/DeepLearningPractice/blob/master/ChurnPredictionusingANN.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import keras
import pandas as pd

Using TensorFlow backend.

In [1]:
! git clone https://github.com/Arko2016/DeepLearningPractice.git

Cloning into 'DeepLearningPractice'...
remote: Enumerating objects: 6, done.
remote: Counting objects: 100% (6/6), done.
remote: Compressing objects: 100% (4/4), done.
remote: Total 6 (delta 0), reused 0 (delta 0), pack-reused 0
Unpacking objects: 100% (6/6), done.

In [3]:
! ls

DeepLearningPractice  sample_data

In [0]:
! cd DeepLearningPractice/

In [7]:
data = pd.read_csv('DeepLearningPractice/Churn_Modelling.csv')
data.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]